<template>
  <section class="pet-desc">
    <h2 class="title">{{ pet.name }}</h2>

    <div class="content">
      <div class="left">
        <img :src="pet.image" class="pet-image" />
        <div class="breed">{{ pet.breed }}</div>
      </div>

      <div class="right">
        <h3 class="section-title">Описание породы</h3>
        <p>{{ pet.description }}</p>

        <h3 class="section-title">Характеристика и условия содержания</h3>
        <p>{{ pet.character }}</p>

        <h3 class="section-title">Почему стоит выбрать {{ pet.name }}</h3>
        <p>{{ pet.reason }}</p>
      </div>
    </div>
  </section>
</template>

<script>
export default {
  name: 'PetDescription',
  props: ['id'],

  data() {
    return {
      pets: {
        1: {
          name: 'Дружок',
          breed: 'Джек-рассел-терьер',
          image: '/assets/images/Jack.png',
          description:
            'Джек-рассел-терьер — активная и весёлая собака среднего размера, выведенная в Англии для охоты. Она отличается смелостью, любопытством и дружелюбностью, идеально подходит семьям с детьми и активными хозяевами.',
          character:
            'Джек, 2 года, энергичный и дружелюбный терьер. Любит активность, легко обучается, дружит с детьми. Для комфортного содержания требуются ежедневные прогулки минимум 2 часа и минимальный уход за короткой шерстью.',
          reason:
            'Веселый, активный, общительный, легко обучается командам. Отличный спутник для активного образа жизни и семейных прогулок. Подходит тем, кто готов уделять много внимания собаке и обеспечить ей насыщенную жизнь.'
        },

        2: {
          name: 'Кира',
          breed: 'Оцикэт',
          image: '/assets/images/Orient.png',
          description:
            'Оцикет — красивая кошка с пятнистым окрасом, крупными размерами и развитым интеллектом.',
          character:
            'Активная, любознательная, ласковая, быстро привязывается к семье, легко приспосабливается к домашним условиям. Для условия содержания нужен просторный дом или квартира, доступ к игрушкам, периодическое расчёсывание шерсти.',
          reason:
            'Интеллектуальна, спокойна, коммуникабельна, подойдёт активным семьям с детьми и другим питомцам.'
        },

        3: {
          name: 'Муля', 
          breed: 'Шотландская',
          image: '/assets/images/Scotland.png',
          description:
            'Шотландская — кошка с висячими ушами, круглой мордочкой и мягкой плюшевой шерстью.',
          character:
            'Спокойная, уравновешенная, ласковая, обожает общение с людьми, хорошо ладит с детьми и другими животными. Условия содержания-комфортный дом или квартира, правильное питание, регулярный уход за шерстью и когтями.',
          reason:
            'Идеально подойдет тем, кто ищет преданного друга, ценящего домашний уют и тихие вечера рядом с хозяином.'
        },

        4: {
          name: 'Джек',
          breed: 'Мальтипу',
          image: '/assets/images/Maltipu.png',
          description:
            'Мальтипу — миниатюрная собака, помесь мальтийской болонки и пуделя, обладает шелковистой шерстью и выразительными глазами.',
          character:
            'Дружелюбный, игривый, ласковый, хорошо ладит с детьми и другими животными, проста в обучении. Условия содержания-подходит для квартиры, требует регулярного ухода за шерстью, частых прогулок и общения.',
          reason:
            'Отличный выбор для тех, кто мечтает о верном спутнике-компаньоне, легком в содержании и заботливом друге.'
        }
      }
    };
  },

  computed: {
    pet() {
      return this.pets[this.$route.params.id];
    }
  }
};
</script>

<style scoped>
.title {
  text-align: center;
  font-size: 42px;
  color: #3d2c25;
  margin-bottom: 30px;
  margin-top: 30px;
}

.content {
  display: flex;
  gap: 40px;
  max-width: 1600px;
  margin: 0 auto;
}

.left {
  background-color: #ffff;
  padding-bottom: 100px;
  width: 35%;
  text-align: center;
  border-radius: 30px;
}

.pet-image {
  width: 100%;
  border-radius: 10px 0px 0px;
  height: 100%;
}

.breed {
  margin-top: 10px;
  font-size: 30px;
}

.right {
  width: 65%;
  font-size: 25px;
}

.section-title {
  font-size: 45px;
  margin-top: 55px;
  color: #a8753a;
}
</style>
